In the previous lesson you gained an understanding of built-in database functions.

Now create and populate the PETSALE table in the database using the attached SQL script, and practice the queries in the previous lesson to solidify your understanding of built-in database functions.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

from datetime import timedelta

%matplotlib inline
sns.set_style('dark')
sns.set(font_scale=1.2)

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',None)

Task 1: Create the INSTRUCTOR table as defined above. Have the ins_id be the primary key, and ensure the lastname and firstname are not null.

In [2]:
col = {'ID': [], 'ANIMAL': [], 'QUANTITY': [], 'SALEPRICE': [],'SALEDATE': []}

In [3]:
petsale = pd.DataFrame(data=col)

In [4]:
petsale

Empty DataFrame
Columns: [ID, ANIMAL, QUANTITY, SALEPRICE, SALEDATE]
Index: []

In [5]:
animals = {'ID':[1,2,3,4,5,6,7,8,9], 
           'ANIMAL': ['Cat','Dog','Dog','Parrot','Dog','Hamster','Cat','Goldfish','Dog'], 
           'QUANTITY': [9,3,1,2,1,6,1,24,2],
           'SALEPRICE': [450.09,666.66,100.00,50.00,75.75,60.60,44.44,48.48,2222.22],
           'SALEDATE': ['2018-05-29','2018-06-01','2018-06-04','2018-06-04','2018-06-10','2018-06-11','2018-06-11','2018-06-14','2018-06-15']}

In [6]:
df2 = pd.DataFrame(animals)

In [7]:
df2

   ID    ANIMAL  QUANTITY  SALEPRICE    SALEDATE
0   1       Cat         9     450.09  2018-05-29
1   2       Dog         3     666.66  2018-06-01
2   3       Dog         1     100.00  2018-06-04
3   4    Parrot         2      50.00  2018-06-04
4   5       Dog         1      75.75  2018-06-10
5   6   Hamster         6      60.60  2018-06-11
6   7       Cat         1      44.44  2018-06-11
7   8  Goldfish        24      48.48  2018-06-14
8   9       Dog         2    2222.22  2018-06-15

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      int64
 1   ANIMAL     9 non-null      object
 2   QUANTITY   9 non-null      int64
 3   SALEPRICE  9 non-null      float64
 4   SALEDATE   9 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 488.0+ bytes

In [9]:
df2["SALEDATE"] = pd.to_datetime(df2["SALEDATE"])

In [10]:
df2

   ID    ANIMAL  QUANTITY  SALEPRICE   SALEDATE
0   1       Cat         9     450.09 2018-05-29
1   2       Dog         3     666.66 2018-06-01
2   3       Dog         1     100.00 2018-06-04
3   4    Parrot         2      50.00 2018-06-04
4   5       Dog         1      75.75 2018-06-10
5   6   Hamster         6      60.60 2018-06-11
6   7       Cat         1      44.44 2018-06-11
7   8  Goldfish        24      48.48 2018-06-14
8   9       Dog         2    2222.22 2018-06-15

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         9 non-null      int64
 1   ANIMAL     9 non-null      object
 2   QUANTITY   9 non-null      int64
 3   SALEPRICE  9 non-null      float64
 4   SALEDATE   9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 488.0+ bytes

select SUM(SALEPRICE) from PETSALE

In [12]:
df2['SALEPRICE'].sum()

3718.24

select SUM(SALEPRICE) AS SUM_OF_SALEPRICE from PETSALE

In [13]:
sum_of_saleprice = df2['SALEPRICE'].sum()
sum_of_saleprice

3718.24

select MAX(QUANTITY) from PETSALE

In [14]:
df2['QUANTITY'].max()

24

select AVG(SALEPRICE) from PETSALE

In [15]:
df2["SALEPRICE"].mean()

413.1377777777777

select AVG( SALEPRICE / QUANTITY ) from PETSALE where ANIMAL = 'Dog'

In [16]:
df2["SQ"] = df2["SALEPRICE"]/df2["QUANTITY"]

In [17]:
df2

   ID    ANIMAL  QUANTITY  SALEPRICE   SALEDATE       SQ
0   1       Cat         9     450.09 2018-05-29    50.01
1   2       Dog         3     666.66 2018-06-01   222.22
2   3       Dog         1     100.00 2018-06-04   100.00
3   4    Parrot         2      50.00 2018-06-04    25.00
4   5       Dog         1      75.75 2018-06-10    75.75
5   6   Hamster         6      60.60 2018-06-11    10.10
6   7       Cat         1      44.44 2018-06-11    44.44
7   8  Goldfish        24      48.48 2018-06-14     2.02
8   9       Dog         2    2222.22 2018-06-15  1111.11

In [18]:
df3 = df2[df2['ANIMAL'] == 'Dog']
df3

   ID ANIMAL  QUANTITY  SALEPRICE   SALEDATE       SQ
1   2    Dog         3     666.66 2018-06-01   222.22
2   3    Dog         1     100.00 2018-06-04   100.00
4   5    Dog         1      75.75 2018-06-10    75.75
8   9    Dog         2    2222.22 2018-06-15  1111.11

In [19]:
df3["SQ"].mean()

377.27

select ROUND(SALEPRICE) from PETSALE

In [20]:
df2['SALEPRICE'].round(0)

0     450.0
1     667.0
2     100.0
3      50.0
4      76.0
5      61.0
6      44.0
7      48.0
8    2222.0
Name: SALEPRICE, dtype: float64

select LENGTH(ANIMAL) from PETSALE

In [21]:
len(df2["ANIMAL"])

9

In [22]:
df2["ANIMAL"].str.upper()

0         CAT
1         DOG
2         DOG
3      PARROT
4         DOG
5     HAMSTER
6         CAT
7    GOLDFISH
8         DOG
Name: ANIMAL, dtype: object

select DISTINCT(UCASE(ANIMAL)) from PETSALE

In [23]:
df2["ANIMAL"].str.upper().unique()

array(['CAT', 'DOG', 'PARROT', 'HAMSTER', 'GOLDFISH'], dtype=object)

select * from PETSALE where LCASE(ANIMAL) = 'cat'

In [24]:
df2[df2["ANIMAL"] == 'Cat']

   ID ANIMAL  QUANTITY  SALEPRICE   SALEDATE     SQ
0   1    Cat         9     450.09 2018-05-29  50.01
6   7    Cat         1      44.44 2018-06-11  44.44

select DAY(SALEDATE) from PETSALE where ANIMAL = 'Cat'

In [25]:
df2["DAY"] = df2["SALEDATE"].dt.day

In [26]:
df2

   ID    ANIMAL  QUANTITY  SALEPRICE   SALEDATE       SQ  DAY
0   1       Cat         9     450.09 2018-05-29    50.01   29
1   2       Dog         3     666.66 2018-06-01   222.22    1
2   3       Dog         1     100.00 2018-06-04   100.00    4
3   4    Parrot         2      50.00 2018-06-04    25.00    4
4   5       Dog         1      75.75 2018-06-10    75.75   10
5   6   Hamster         6      60.60 2018-06-11    10.10   11
6   7       Cat         1      44.44 2018-06-11    44.44   11
7   8  Goldfish        24      48.48 2018-06-14     2.02   14
8   9       Dog         2    2222.22 2018-06-15  1111.11   15

In [27]:
df2["MONTH"] = df2["SALEDATE"].dt.month

In [28]:
df2

   ID    ANIMAL  QUANTITY  SALEPRICE   SALEDATE       SQ  DAY  MONTH
0   1       Cat         9     450.09 2018-05-29    50.01   29      5
1   2       Dog         3     666.66 2018-06-01   222.22    1      6
2   3       Dog         1     100.00 2018-06-04   100.00    4      6
3   4    Parrot         2      50.00 2018-06-04    25.00    4      6
4   5       Dog         1      75.75 2018-06-10    75.75   10      6
5   6   Hamster         6      60.60 2018-06-11    10.10   11      6
6   7       Cat         1      44.44 2018-06-11    44.44   11      6
7   8  Goldfish        24      48.48 2018-06-14     2.02   14      6
8   9       Dog         2    2222.22 2018-06-15  1111.11   15      6

In [29]:
df4 = df2[df2["ANIMAL"] == 'Cat']
df4

   ID ANIMAL  QUANTITY  SALEPRICE   SALEDATE     SQ  DAY  MONTH
0   1    Cat         9     450.09 2018-05-29  50.01   29      5
6   7    Cat         1      44.44 2018-06-11  44.44   11      6

In [30]:
df4["DAY"]

0    29
6    11
Name: DAY, dtype: int64

select COUNT(*) from PETSALE where MONTH(SALEDATE)='05'

In [31]:
df5 = df2[df2["MONTH"] == 5]

In [32]:
df5

   ID ANIMAL  QUANTITY  SALEPRICE   SALEDATE     SQ  DAY  MONTH
0   1    Cat         9     450.09 2018-05-29  50.01   29      5

In [33]:
df5.count()

ID           1
ANIMAL       1
QUANTITY     1
SALEPRICE    1
SALEDATE     1
SQ           1
DAY          1
MONTH        1
dtype: int64

select (SALEDATE + 3 DAYS) from PETSALE

In [34]:
df2

   ID    ANIMAL  QUANTITY  SALEPRICE   SALEDATE       SQ  DAY  MONTH
0   1       Cat         9     450.09 2018-05-29    50.01   29      5
1   2       Dog         3     666.66 2018-06-01   222.22    1      6
2   3       Dog         1     100.00 2018-06-04   100.00    4      6
3   4    Parrot         2      50.00 2018-06-04    25.00    4      6
4   5       Dog         1      75.75 2018-06-10    75.75   10      6
5   6   Hamster         6      60.60 2018-06-11    10.10   11      6
6   7       Cat         1      44.44 2018-06-11    44.44   11      6
7   8  Goldfish        24      48.48 2018-06-14     2.02   14      6
8   9       Dog         2    2222.22 2018-06-15  1111.11   15      6

In [35]:
df2["NEWDATE"] = df2["SALEDATE"] + pd.DateOffset(n=3)

In [36]:
df2

,ID,ANIMAL,QUANTITY,SALEPRICE,SALEDATE,SQ,DAY,MONTH,NEWDATE
0,1,Cat,9,450.09,2018-05-29,50.01,29,5,2018-06-01
1,2,Dog,3,666.66,2018-06-01,222.22,1,6,2018-06-04
2,3,Dog,1,100.00,2018-06-04,100.00,4,6,2018-06-07
3,4,Parrot,2,50.00,2018-06-04,25.00,4,6,2018-06-07
4,5,Dog,1,75.75,2018-06-10,75.75,10,6,2018-06-13
5,6,Hamster,6,60.60,2018-06-11,10.10,11,6,2018-06-14
6,7,Cat,1,44.44,2018-06-11,44.44,11,6,2018-06-14
7,8,Goldfish,24,48.48,2018-06-14,2.02,14,6,2018-06-17
8,9,Dog,2,2222.22,2018-06-15,1111.11,15,6,2018-06-18

select (CURRENT DATE - SALEDATE) from PETSALE

In [37]:
df2["CURRENTDATE"] = pd.to_datetime("today").date()

In [38]:
df2

,ID,ANIMAL,QUANTITY,SALEPRICE,SALEDATE,SQ,DAY,MONTH,NEWDATE,CURRENTDATE
0,1,Cat,9,450.09,2018-05-29,50.01,29,5,2018-06-01,2020-07-20
1,2,Dog,3,666.66,2018-06-01,222.22,1,6,2018-06-04,2020-07-20
2,3,Dog,1,100.00,2018-06-04,100.00,4,6,2018-06-07,2020-07-20
3,4,Parrot,2,50.00,2018-06-04,25.00,4,6,2018-06-07,2020-07-20
4,5,Dog,1,75.75,2018-06-10,75.75,10,6,2018-06-13,2020-07-20
5,6,Hamster,6,60.60,2018-06-11,10.10,11,6,2018-06-14,2020-07-20
6,7,Cat,1,44.44,2018-06-11,44.44,11,6,2018-06-14,2020-07-20
7,8,Goldfish,24,48.48,2018-06-14,2.02,14,6,2018-06-17,2020-07-20
8,9,Dog,2,2222.22,2018-06-15,1111.11,15,6,2018-06-18,2020-07-20

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           9 non-null      int64
 1   ANIMAL       9 non-null      object
 2   QUANTITY     9 non-null      int64
 3   SALEPRICE    9 non-null      float64
 4   SALEDATE     9 non-null      datetime64[ns]
 5   SQ           9 non-null      float64
 6   DAY          9 non-null      int64
 7   MONTH        9 non-null      int64
 8   NEWDATE      9 non-null      datetime64[ns]
 9   CURRENTDATE  9 non-null      object
dtypes: datetime64[ns](2), float64(2), int64(4), object(2)
memory usage: 848.0+ bytes

In [40]:
df2["CURRENTDATE"] = pd.to_datetime(df2["CURRENTDATE"])

In [41]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           9 non-null      int64
 1   ANIMAL       9 non-null      object
 2   QUANTITY     9 non-null      int64
 3   SALEPRICE    9 non-null      float64
 4   SALEDATE     9 non-null      datetime64[ns]
 5   SQ           9 non-null      float64
 6   DAY          9 non-null      int64
 7   MONTH        9 non-null      int64
 8   NEWDATE      9 non-null      datetime64[ns]
 9   CURRENTDATE  9 non-null      datetime64[ns]
dtypes: datetime64[ns](3), float64(2), int64(4), object(1)
memory usage: 848.0+ bytes

In [42]:
df2["DIFFDATE"] = df2["CURRENTDATE"] -  df2["SALEDATE"]

In [43]:
df2

,ID,ANIMAL,QUANTITY,SALEPRICE,SALEDATE,SQ,DAY,MONTH,NEWDATE,CURRENTDATE,DIFFDATE
0,1,Cat,9,450.09,2018-05-29,50.01,29,5,2018-06-01,2020-07-20,783 days
1,2,Dog,3,666.66,2018-06-01,222.22,1,6,2018-06-04,2020-07-20,780 days
2,3,Dog,1,100.00,2018-06-04,100.00,4,6,2018-06-07,2020-07-20,777 days
3,4,Parrot,2,50.00,2018-06-04,25.00,4,6,2018-06-07,2020-07-20,777 days
4,5,Dog,1,75.75,2018-06-10,75.75,10,6,2018-06-13,2020-07-20,771 days
5,6,Hamster,6,60.60,2018-06-11,10.10,11,6,2018-06-14,2020-07-20,770 days
6,7,Cat,1,44.44,2018-06-11,44.44,11,6,2018-06-14,2020-07-20,770 days
7,8,Goldfish,24,48.48,2018-06-14,2.02,14,6,2018-06-17,2020-07-20,767 days
8,9,Dog,2,2222.22,2018-06-15,1111.11,15,6,2018-06-18,2020-07-20,766 days